HieuTran2002/STM32-makefile/G4/G4_FreeRTOS/Core/Inc/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include "stm32g4xx.h"  // Adjust this if needed

//-------------------------------------------------------------
// FreeRTOS Basic Configurations
//-------------------------------------------------------------
#define configUSE_PREEMPTION                    1
#define configUSE_IDLE_HOOK                     0
#define configUSE_TICK_HOOK                     0
#define configCPU_CLOCK_HZ                      ( SystemCoreClock )  // Set in STM32 HAL
#define configTICK_RATE_HZ                      ( ( TickType_t ) 1000 ) // 1 ms tick
#define configMAX_PRIORITIES                   ( 5 )
#define configMINIMAL_STACK_SIZE               ( ( uint16_t ) 128 )
#define configTOTAL_HEAP_SIZE                  ( ( size_t ) ( 10 * 1024 ) )
#define configMAX_TASK_NAME_LEN                ( 16 )
#define configUSE_16_BIT_TICKS                 0
#define configIDLE_SHOULD_YIELD                1
#define configUSE_MUTEXES                      1

//-------------------------------------------------------------
// Memory Allocation
//-------------------------------------------------------------
#define configSUPPORT_DYNAMIC_ALLOCATION       1
#define configSUPPORT_STATIC_ALLOCATION        0

//-------------------------------------------------------------
// Task Configurations
//-------------------------------------------------------------
#define configUSE_APPLICATION_TASK_TAG         0
#define configCHECK_FOR_STACK_OVERFLOW         2
#define configUSE_RECURSIVE_MUTEXES            1
#define configQUEUE_REGISTRY_SIZE              8
#define configUSE_COUNTING_SEMAPHORES          1

//-------------------------------------------------------------
// Software Timer Configurations
//-------------------------------------------------------------
#define configUSE_TIMERS                       1
#define configTIMER_TASK_PRIORITY              ( 3 )
#define configTIMER_QUEUE_LENGTH               10
#define configTIMER_TASK_STACK_DEPTH           ( configMINIMAL_STACK_SIZE * 2 )

//-------------------------------------------------------------
// Optional Functions
//-------------------------------------------------------------
#define INCLUDE_vTaskPrioritySet               1
#define INCLUDE_uxTaskPriorityGet              1
#define INCLUDE_vTaskDelete                    1
#define INCLUDE_vTaskSuspend                   1
#define INCLUDE_vTaskDelay                     1
#define INCLUDE_xTaskGetSchedulerState         1
#define INCLUDE_xTimerPendFunctionCall         1

//-------------------------------------------------------------
// Cortex-M4 / FPU Settings
//-------------------------------------------------------------
#define configPRIO_BITS                        __NVIC_PRIO_BITS
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY  15
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5
#define configKERNEL_INTERRUPT_PRIORITY        ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
#define configMAX_SYSCALL_INTERRUPT_PRIORITY   ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

// Enable FPU
#define configENABLE_FPU                       1
#define configENABLE_MPU                       0

//-------------------------------------------------------------
// Assert Function
//-------------------------------------------------------------
#define configASSERT( x ) if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); }

#endif /* FREERTOS_CONFIG_H */

